Ran Plan for dir: `service_deployment/core-api` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.deployment.aws_iam_role.codebuild_role has been changed
~ resource "aws_iam_role" "codebuild_role" {
        id                    = "avn-dev-core-api-codebuild-role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AdministratorAccess",
        ]
        name                  = "avn-dev-core-api-codebuild-role"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.deployment.aws_iam_role.codepipeline_role has been changed
~ resource "aws_iam_role" "codepipeline_role" {
        id                    = "avn-dev-core-api-codepipeline-role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AdministratorAccess",
        ]
        name                  = "avn-dev-core-api-codepipeline-role"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.deployment.github_repository.repo[0] has been changed
~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"5f2c11c7d5d41a6014c9842779a2f38a5de4811eedcb56d4c2d3fb34f4d17fd1\"" -> "W/\"3fc6c430d29eb47e520ab4b8b2707bca4a07520d36bd608b5fdf0b02698265d3\""
        id                     = "avn-core-api"
        name                   = "avn-core-api"
        # (25 unchanged attributes hidden)
    }
  # module.deployment.aws_codebuild_project.build_project has been changed
~ resource "aws_codebuild_project" "build_project" {
        id                     = "arn:aws:codebuild:ap-southeast-2:714071859213:project/avn-dev-core-api"
        name                   = "avn-dev-core-api"
      + tags                   = {}
        # (8 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }
  # module.deployment.aws_codepipeline_webhook.codepipeline_webhook has been changed
~ resource "aws_codepipeline_webhook" "codepipeline_webhook" {
        id              = "arn:aws:codepipeline:ap-southeast-2:714071859213:webhook:webhook-codepipeline-avn-dev-core-api"
        name            = "webhook-codepipeline-avn-dev-core-api"
      + tags            = {}
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.deployment.aws_codepipeline.codepipeline has been changed
~ resource "aws_codepipeline" "codepipeline" {
        id       = "avn-dev-core-api"
        name     = "avn-dev-core-api"
      + tags     = {}
        # (3 unchanged attributes hidden)


      ~ stage {
            name = "Source"

          ~ action {
              + input_artifacts  = []
                name             = "Source"
                # (10 unchanged attributes hidden)
            }
        }
      ~ stage {
            name = "Deploy"

          ~ action {
                name             = "Deploy"
              + output_artifacts = []
                # (7 unchanged attributes hidden)
            }
        }
        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.deployment.aws_ecs_service.ecs_service must be replaced
-/+ resource "aws_ecs_service" "ecs_service" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ap-southeast-2:714071859213:service/avn-dev-compute-ecs-cluster/avn-dev-core-api" -> (known after apply)
        name                               = "avn-dev-core-api"
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (10 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer { # forces replacement
          - container_name   = "avn-dev-core-api-php" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:targetgroup/avn-dev-core-api-tg/f4f843b101299c5d" -> null
        }
      + load_balancer { # forces replacement
          + container_name   = "avn-dev-core-api-php"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.deployment.aws_lb_listener.nlb_http_listener will be updated in-place
~ resource "aws_lb_listener" "nlb_http_listener" {
        id                = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:listener/net/avn-dev-compute-ecs-nlb/e71b6466f0f517b8/1103f82478da89d6"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:targetgroup/avn-dev-core-api-tg/f4f843b101299c5d" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.deployment.aws_lb_target_group.nlb_tg must be replaced
-/+ resource "aws_lb_target_group" "nlb_tg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:targetgroup/avn-dev-core-api-tg/f4f843b101299c5d" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/avn-dev-core-api-tg/f4f843b101299c5d" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:targetgroup/avn-dev-core-api-tg/f4f843b101299c5d" -> (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
        name                               = "avn-dev-core-api-tg"
      ~ preserve_client_ip                 = "false" -> (known after apply)
      + protocol_version                   = (known after apply)
        tags                               = {
            "Code"    = "core"
            "Env"     = "dev"
            "Feature" = "api-tg"
            "Name"    = "avn-dev-core-api-tg"
        }
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ interval            = 30 -> 35 # forces replacement
          + matcher             = (known after apply)
          + path                = (known after apply)
          ~ timeout             = 10 -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 0 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "source_ip" -> (known after apply)
        }
    }

  # module.deployment.aws_secretsmanager_secret.secret will be created
+ resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "avn-dev-core-api"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.

Warning: The CodePipeline GitHub version 1 action provider is deprecated.

  with module.deployment.aws_codepipeline.codepipeline,
  on ../../modules/deployment/codepipeline.tf line 39, in resource "aws_codepipeline" "codepipeline":
  39:       provider         = "GitHub"

Use a GitHub version 2 action (with a CodeStar Connection
`aws_codestarconnections_connection`) instead. See
https://docs.aws.amazon.com/codepipeline/latest/userguide/update-github-action-connections.html

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d service_deployment/core-api`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.blast.co.id/lock?id=greyhats13%252Favana-aws-infra%252Fservice_deployment%252Fcore-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d service_deployment/core-api`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
